Catalogs/ПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПриборыУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тарифность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТарифностьСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрацииПоказаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРегистрацииПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПломбыПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПломбыПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПломбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыРегистрацииПоказанийСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыРегистрацииПоказанийСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходЗаПериодРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарастающимИтогом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийУправленияПриборамиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияПриборамиУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеНаПоверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПослеПоверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПриборыУчета/Ext/ManagerModule.bsl
// Получает максимальное значение показания прибора учета в зависимости от разрядности.
Функция ПолучитьМаксЗначениеПоказанияПрибораУчета(ПриборУчета)
	
	Возврат Pow(10, ПриборУчета.Разрядность);
	
КонецФункции // ПолучитьМаксЗначениеПоказанияПрибораУчета()

// Функция определяет, попали ли показания прибора учета в
// промежуток перехода через нулевые показания.
//
Функция ПереходПоказанийЧерезНоль(ПриборУчета, ТекущееПоказание, ПредыдущееПоказание)
	
	ПоказаниеВПределахПерехода = Ложь;
	
	МаксПоказание = ПолучитьМаксЗначениеПоказанияПрибораУчета(ПриборУчета);
	ПредРасчЧисло = ПредыдущееПоказание / МаксПоказание;
	ТекРасчЧисло  = ТекущееПоказание    / МаксПоказание;
	
	Если (ПредРасчЧисло >= 0.9 И ПредРасчЧисло < 1) И (ТекРасчЧисло < 0.9) Тогда
		ПоказаниеВПределахПерехода = Истина;
	КонецЕсли;
	
	Возврат ПоказаниеВПределахПерехода;
	
КонецФункции

// Функция получет расход  по прибору учета.
//
Функция ПолучитьРасход(СтруктураДанные) Экспорт
	
	ПриборУчета = СтруктураДанные.ПриборУчета;	
	ТекущееПоказание = СтруктураДанные.ТекущееПоказание;
	ПредыдущееПоказание = СтруктураДанные.ПредыдущееПоказание;
	
	СтруктураДанные.Вставить("ЕстьПереходПоказанийЧерезНоль", Ложь);
	СтруктураДанные.Вставить("РасходЗаПериодРасчета", Ложь);
	СтруктураДанные.Вставить("РасходПоПриборуУчета", 0);
 	СтруктураДанные.Вставить("ТекстОшибки", "");

	Если ПроверитьПоказанияНаРазрядность(ПриборУчета, ТекущееПоказание) Тогда
		ТекстОшибки = "Показание больше максимального значения для прибора учета " + Строка(ПриборУчета);
		СтруктураДанные.ТекстОшибки = ТекстОшибки;
		Возврат СтруктураДанные;
	КонецЕсли;
	
	Если ПриборУчета.СпособРегистрацииПоказаний =
	         Перечисления.СпособыРегистрацииПоказанийСчетчиков.РасходЗаПериодРасчета Тогда
			 
		СтруктураДанные.РасходЗаПериодРасчета = Истина;
		СтруктураДанные.РасходПоПриборуУчета = ТекущееПоказание;
			 
		Возврат СтруктураДанные;
		
	КонецЕсли;
	
	ЕстьПереходПоказанийЧерезНоль = ПереходПоказанийЧерезНоль(ПриборУчета, ТекущееПоказание, ПредыдущееПоказание);
	
	РасходПоПриборуУчета = ТекущееПоказание - ПредыдущееПоказание;
	Если РасходПоПриборуУчета < 0 Тогда
		Если ЕстьПереходПоказанийЧерезНоль Тогда
			МаксПоказание = ПолучитьМаксЗначениеПоказанияПрибораУчета(ПриборУчета);
			РасходПоПриборуУчета = (МаксПоказание - ПредыдущееПоказание) + ТекущееПоказание;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанные.РасходПоПриборуУчета = РасходПоПриборуУчета;
	СтруктураДанные.ЕстьПереходПоказанийЧерезНоль = ЕстьПереходПоказанийЧерезНоль;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьРасход()

Функция ПроверитьПоказанияНаРазрядность(ПриборУчета, ТекущееПоказание) 
	
	РазрядностьПрибораУчета = ПриборУчета.Разрядность;
	ТекРазряд = СтрДлина(Формат(Цел(ТекущееПоказание),"ЧГ=0; ЧЦ=0"));
	
	Если ТекРазряд > РазрядностьПрибораУчета Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//Процедуры печати
//Процедура печати 
Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт                                                 
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктУстановкиСнятияПломбы") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктУстановкиСнятияПломбы", "ПриборыУчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "АктУстановкиСнятияПломбы", ПараметрыПечати));
	КонецЕсли;
	
	
КонецПроцедуры

//Формирование печатных форм
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПриборыУчета";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		//Если Не ПервыйДокумент Тогда
		//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;
		//ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "АктУстановкиСнятияПломбы" Тогда
			
			ТабличныйДокумент = ПечатьАктУстановкиСнятияПломбы(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		КонецЕсли;                         
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.Защита = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция  ПечатьАктУстановкиСнятияПломбы(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)
	
	Макет = ПолучитьМакет("АктУстановкиСнятияПломбы");
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПломбыПриборовУчетаСрезПоследних.Период,
		|	ПломбыПриборовУчетаСрезПоследних.ПриборУчета,
		|	ПломбыПриборовУчетаСрезПоследних.ВидПломбы,
		|	ПломбыПриборовУчетаСрезПоследних.СерийныйНомер,
		|	ПломбыПриборовУчетаСрезПоследних.Действует КАК Действует,
		|	ПломбыПриборовУчетаСрезПоследних.Организация КАК Организация,
		|	ПломбыПриборовУчетаСрезПоследних.Здание КАК Здание,
		|	ПломбыПриборовУчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	ПломбыПриборовУчетаСрезПоследних.Организация.КодПоЕДРПОУ КАК ЕДРПОУ,
		|	ПломбыПриборовУчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, """") КАК ОтветственныйВладелец,
		|	ПломбыПриборовУчетаСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПломбыПриборовУчета.СрезПоследних(, Регистратор = &Регистратор) КАК ПломбыПриборовУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО ПломбыПриборовУчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ИТОГИ
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(Здание),
		|	МАКСИМУМ(ЛицевойСчет),
		|	МАКСИМУМ(ЕДРПОУ),
		|	МАКСИМУМ(Квартира),
		|	МАКСИМУМ(ОтветственныйВладелец),
		|	МАКСИМУМ(Регистратор)
		|ПО
		|	Действует";

	Запрос.УстановитьПараметр("Регистратор", ТекущийДокумент);

	Результат = Запрос.Выполнить();

	ВыборкаДействует = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаДействует.Следующий() Цикл
		ТекстЗаголовка = ?(КодЯзыкаПечать = "uk","Акт №"+ТекущийДокумент.Номер+" вiд "+Строка(Формат(ТекущийДокумент.Дата,"ДФ=dd.MM.yyyy"))+"р.",
							"Акт №"+ТекущийДокумент.Номер+" от "+Строка(Формат(ТекущийДокумент.Дата,"ДФ=dd.MM.yyyy"))+"г.");
		Если ВыборкаДействует.Действует Тогда
			ТекстПодзаголовка = ?(КодЯзыкаПечать = "uk","установка пломби приладу обліку",
							"установка пломбы прибора учета");
							
			ДействиеНадпись = ?(КодЯзыкаПечать = "uk","Установку пломб виконав співробітник",
							"Установку пломб произвел сотрудник");				
		Иначе
			ТекстПодзаголовка = ?(КодЯзыкаПечать = "uk","зняття пломби приладу обліку",
							"снятие пломбы прибора учета");
							
			ДействиеНадпись = ?(КодЯзыкаПечать = "uk","Зняття пломб виконав співробітник",
							"Снятие пломб произвел сотрудник");				
			//Получим и заполним данные снятия пломбы
			
			Если ТипЗнч(ВыборкаДействует.Регистратор) = Тип("ДокументСсылка.ЗаменаПриборовУчета") Тогда
				Причина = ?(КодЯзыкаПечать = "uk","Заміна приладу обліку",
							"Замена прибора учета");
			Иначе
				
				Если ВыборкаДействует.Регистратор.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку Тогда
					Причина = ?(КодЯзыкаПечать = "uk","Відключення приладу обліку на перевірку",
					"Отключение прибора учета на поверку");	
				ИначеЕсли ВыборкаДействует.Регистратор.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета Тогда	
					Причина = ?(КодЯзыкаПечать = "uk","Відключення приладу обліку",
					"Отключение прибора учета");
					
				ИначеЕсли ВыборкаДействует.Регистратор.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ЗаменаПломбы Тогда	
					Причина = ?(КодЯзыкаПечать = "uk","Заміна пломби",
					"Замена пломбы");
						
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ЛицевойСчет = ВыборкаДействует.ЛицевойСчет;
		ОтветственныйВладелец = ВыборкаДействует.ОтветственныйВладелец;
		Организация = ВыборкаДействует.Организация;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Организация = Организация;
		ОбластьШапка.Параметры.ЕДРПОУ = ВыборкаДействует.ЕДРПОУ;
		ОбластьШапка.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапка.Параметры.ТекстПодзаголовка = ТекстПодзаголовка;
		ОбластьШапка.Параметры.АдресПроведенияРабот = Строка(ВыборкаДействует.Здание)+ ", " +Строка(ВыборкаДействует.Квартира); 
		ОбластьШапка.Параметры.ЛицевойСчет = ЛицевойСчет;
		ОбластьШапка.Параметры.ОтветственныйВладелец = ОтветственныйВладелец;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Если НЕ ВыборкаДействует.Действует Тогда
			ОбластьШапкаДополнение = Макет.ПолучитьОбласть("ШапкаДополнение");
			ОбластьШапкаДополнение.Параметры.Причина = Причина;
			ТабличныйДокумент.Вывести(ОбластьШапкаДополнение);
		КонецЕсли;	
		
		
		ОбластьШапкаТаблицы =  Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаДетальныеЗаписи = ВыборкаДействует.Выбрать();
        Сч = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Номер = Сч;
			ОбластьСтрока.Параметры.ПриборУчета = ВыборкаДетальныеЗаписи.ПриборУчета;
			ОбластьСтрока.Параметры.ВидПломбы  = ВыборкаДетальныеЗаписи.ВидПломбы;
			ОбластьСтрока.Параметры.СерийныйНомерПломбы	 = ВыборкаДетальныеЗаписи.СерийныйНомер;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			Сч = Сч+1;
		КонецЦикла;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ОтветственныйВладелец = ОтветственныйВладелец;
		ОбластьПодвал.Параметры.Организация = Организация;
		ОбластьПодвал.Параметры.ЛицевойСчет = ЛицевойСчет;
		ОбластьПодвал.Параметры.ДействиеНадпись = ДействиеНадпись;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ТабличныйДокумент.вывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;

	Возврат ТабличныйДокумент;

	
КонецФункции
